    // Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
    // 456 -> 5
    // 782 -> 8
    // 918 -> 1


// Console.WriteLine("Введите трехзначное число");
// int num1 = Convert.ToInt32(Console.ReadLine());
// int num2 = (num1 / 10) % 10;
// Console.WriteLine($"Вторая цифра числа: {num2}");



    // Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
    // 645 -> 5
    // 78 -> третьей цифры нет
    // 32679 -> 6

// Console.WriteLine("Введите число");

// int anyNumber = Convert.ToInt32(Console.ReadLine());
// string anyNumberText = Convert.ToString(anyNumber);

// if (anyNumberText.Length > 2)
// {
// Console.WriteLine("третья цифра -> " + anyNumberText[2]);
// }
// else
// {
// Console.WriteLine("-> третьей цифры нет");
// }



    // Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
    // 6 -> да
    // 7 -> да
    // 1 -> нет

// Console.Write("Введи цифру, обозначающую день недели: ");
// int dayNumber = Convert.ToInt32(Console.ReadLine());

//   if (dayNumber == 6 || dayNumber == 7)
//   {
//   Console.WriteLine("да");
//   }
//   else

//   if (dayNumber < 1 || dayNumber > 7)
//   {
//   Console.WriteLine("нет");
//   }
//   else

//   Console.WriteLine("нет");
